import random as r
#牌库
pk=['红心A','红心2','红心3','红心4','红心5','红心6','红心7','红心8', '红心9','红心10','红心J','红心Q',
     '红心K','黑桃A','黑桃2','黑桃3', '黑桃4','黑桃5','黑桃6','黑桃7','黑桃8', '黑桃9','黑桃10','黑桃J',
     '黑桃Q','黑桃K','方块A','方块2','方块3','方块4','方块5','方块6','方块7','方块8', '方块9','方块10',
     '方块J','方块Q','方块K','梅花A','梅花2','梅花3','梅花4','梅花5','梅花6','梅花7','梅花8', '梅花9',
     '梅花10','梅花J','梅花Q','梅花K','小王','大王']
#玩家
dizhu=[]
nm1=[]
nm2=[]

#取牌
def qu_pai(s):
    for i in range(17):
        num=r.randint(0,len(pk)-1)
        s.append(pk[num])
        del pk[num]

#呈现牌
n1=qu_pai(nm1)
print('农民1的牌：')
for i in range(17):
    print(n1[i],n1[i][2:],end='')
